---
title: TagFailures
classe: Autodesk.Revit.DB.BuiltInFailures+TagFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# TagFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCopyTag { get; }` | `TagFailures.CannotCopyTag` | FailureDefinitionId |
| `FailureDefinitionId CannotCopyTagWarn { get; }` | `TagFailures.CannotCopyTagWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteAssociate { get; }` | `TagFailures.CannotPasteAssociate` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteOrphanTags { get; }` | `TagFailures.CannotPasteOrphanTags` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteOrphanTagsWarn { get; }` | `TagFailures.CannotPasteOrphanTagsWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteTag { get; }` | `TagFailures.CannotPasteTag` | FailureDefinitionId |
| `FailureDefinitionId CannotRemapTagReference { get; }` | `TagFailures.CannotRemapTagReference` | FailureDefinitionId |
| `FailureDefinitionId ElementCategoryChangeInvalidatesTag { get; }` | `TagFailures.ElementCategoryChangeInvalidatesTag` | FailureDefinitionId |
| `FailureDefinitionId ElementCategoryChangeInvalidatesTagUpgrade { get; }` | `TagFailures.ElementCategoryChangeInvalidatesTagUpgrade` | FailureDefinitionId |
| `FailureDefinitionId MultiCategoryTagFilterParamNotFoundInElement { get; }` | `TagFailures.MultiCategoryTagFilterParamNotFoundInElement` | FailureDefinitionId |
| `FailureDefinitionId RemoveTagWithNoLeaders { get; }` | `TagFailures.RemoveTagWithNoLeaders` | FailureDefinitionId |
| `FailureDefinitionId TagsCannotBePlacedInUnlocked3dViews { get; }` | `TagFailures.TagsCannotBePlacedInUnlocked3dViews` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```